 
 gcc -g p0final.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
 
 gcc -g p0final.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x822: file p0final.c, line 20.
(gdb) r
Starting program: /home/runner/IA2-Test1-Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p0final.c:20
20  {
(gdb) n
22    input(&base, &height);
(gdb) s
input (base=0x7fff549028cc, height=0x7fff549028d0) at p0final.c:5
5     printf("Enter the base and height of the triangle:\n");
(gdb) n
Enter the base and height of the triangle:
6     scanf("%f%f", base, height);
(gdb) n
4
4
7   }
(gdb) n
main () at p0final.c:24
24    find_area(base, height, &area);
(gdb) s
find_area (base=4, height=4, area=0x7fff549028d4) at p0final.c:11
11    *area = 0.5 * base * height;
(gdb) n
12  }
(gdb) n
main () at p0final.c:25
25    output(base, height, area);
(gdb) s
output (base=4, height=4, area=8) at p0final.c:16
16    printf("The area of the triangle with base %f and height %f is %f\n", base, height, area);
(gdb) print area
$1 = 8
(gdb) n
The area of the triangle with base 4.000000 and height 4.000000 is 8.000000
17  }
(gdb) n
main () at p0final.c:26
26    return 0;
(gdb) q
A debugging session is active.

    Inferior 1 [process 1160] will be killed.

Quit anyway? (y or n) y 
