 gcc -g p1final.c
 ./a.out
Enter the base and height of the triangle:
1
2
The area of the triangle is 1.000000
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x818: file p1final.c, line 16.
(gdb) r
Starting program: /home/runner/IA2-Test1-Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1final.c:16
16  {
(gdb) n
18    input(&a,&b);
(gdb) s
input (base=0x7fff116ad49c, height=0x7fff116ad4a0) at p1final.c:4
4     printf("Enter the base and height of the triangle:\n");
(gdb) n
Enter the base and height of the triangle:
5     scanf("%f %f",base,height);
(gdb) n
1
2
6   }
(gdb) n
main () at p1final.c:19
19    find_area(a,b,&area);
(gdb) p a
$1 = 1
(gdb) p b
$2 = 2
(gdb) s
find_area (base=1, height=2, area=0x7fff116ad4a4) at p1final.c:9
9     *area=0.5*base*height;
(gdb) n
10  }
(gdb) n
main () at p1final.c:20
20    output(a,b,area);
(gdb) s
output (base=1, height=2, area=1) at p1final.c:13
13    printf("The area of the triangle is %f\n",area);
(gdb) n
The area of the triangle is 1.000000
14  }
(gdb) n
main () at p1final.c:21
21    return 0;
(gdb) p area
$3 = 1
(gdb) n
22  }(gdb) q
A debugging session is active.

    Inferior 1 [process 32] will be killed.

Quit anyway? (y or n) y